add extra context in the wallet doc
